SELECT العملاء.العميل, الدعاوى.[matterAR], الجلسات.المحكمة, الجلسات.الدائرة, الدعاوى.[client&Cap], الدعاوى.[opponent&Cap], الدعاوى.[matterSubject], الجلسات.التاريخ, الجلسات.القرار, الجلسات.[صالح/ضد], الدعاوى.محامي, الجلسات.ملاحظات
FROM العملاء INNER JOIN (الدعاوى INNER JOIN الجلسات ON الدعاوى.[matterAR]=الجلسات.[رقم الدعوى]) ON العملاء.العميل=الدعاوى.العميل
WHERE (((الجلسات.التاريخ) Between Forms!التقارير!Text106 And Forms!التقارير!Text108) And ((الجلسات.[صالح/ضد])<>"") And ((الدعاوى.محامي) Like "*" & "إيهاب حمدي" & "*"));
